### [그룹화 처리]
- 주제 : 타이타닉에서 선실의 등급에 따른 생존 비율을 분석

In [14]:
# [1] 모듈 로딩
import pandas as pd
import df_util as util

In [15]:
# [2] 데이터 준비
# [3] CSV => DataFrame로 저장
file_path='titanic.csv'
titanDF = pd.read_csv(file_path)

In [16]:
# [4] 데이터 확인
titanDF

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [17]:
# [5] 분석 주제 ==> 선실의 등급에 따른 생존 비율을 분석
# - 분석 컬럼 즉, 등급과 생존 컬럼
# - loc[행, 열]
pclass_survivedDF=titanDF.loc[:,['pclass','survived']]

In [18]:
pclass_survivedDF

     pclass  survived
0         3         0
1         1         1
2         3         1
3         1         1
4         3         0
..      ...       ...
886       2         0
887       1         1
888       3         0
889       1         1
890       3         0

[891 rows x 2 columns]

In [19]:
util.checkDataFrame(pclass_survivedDF, pclass_survivedDF)

[     pclass  survived
0         3         0
1         1         1
2         3         1
3         1         1
4         3         0
..      ...       ...
886       2         0
887       1         1
888       3         0
889       1         1
890       3         0

[891 rows x 2 columns]]
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 2 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   pclass    891 non-null    int64
 1   survived  891 non-null    int64
dtypes: int64(2)
memory usage: 14.0 KB
index: RangeIndex(start=0, stop=891, step=1)
columns: Index(['pclass', 'survived'], dtype='object')
ndim: 2
shape: (891, 2)

In [20]:
# [5-1] 데이터 전처리 : 결측치, 결측값
# - 결측치 : isna(), isnull()

pclass_survivedDF.isna().sum()

pclass      0
survived    0
dtype: int64

In [21]:
# -- 등급에 따른 그룹화

groupObj=pclass_survivedDF.groupby('pclass')

In [22]:
# -- Group 객체의 속성
# -- groups속성 : 그룹화된 그룹에 속하는 인덱스 정보 저장 Dict 형태
print(groupObj.groups.keys())
print(groupObj.groups.values())

dict_keys([1, 2, 3])
dict_values([Index([  1,   3,   6,  11,  23,  27,  30,  31,  34,  35,
       ...
       853, 856, 857, 862, 867, 871, 872, 879, 887, 889],
      dtype='int64', length=216), Index([  9,  15,  17,  20,  21,  33,  41,  43,  53,  56,
       ...
       848, 854, 861, 864, 865, 866, 874, 880, 883, 886],
      dtype='int64', length=184), Index([  0,   2,   4,   5,   7,   8,  10,  12,  13,  14,
       ...
       875, 876, 877, 878, 881, 882, 884, 885, 888, 890],
      dtype='int64', length=491)])

In [23]:
# -- groups속성 : 각 그룹의 인덱스 속성을 저장 Dict 형태
# print(groupObj.indices)
print(groupObj.indices.keys())

dict_keys([1, 2, 3])

In [24]:
# -- get_group() 메서드 : 그룹화된 그룹들 중에서 특정 그룹 데이터 읽기 메서드
#                         DataFrame을 반환
for key in groupObj.groups.keys():
    print(f'\n[{key}]')
    print(groupObj.get_group(key).ndim, groupObj.get_group(key).shape)
    print(groupObj.get_group(key).min(), groupObj.get_group(key).max())

[1]
2 (216, 2)
pclass      1
survived    0
dtype: int64 pclass      1
survived    1
dtype: int64

[2]
2 (184, 2)
pclass      2
survived    0
dtype: int64 pclass      2
survived    1
dtype: int64

[3]
2 (491, 2)
pclass      3
survived    0
dtype: int64 pclass      3
survived    1
dtype: int64

In [25]:
groupObj.value_counts()

pclass  survived
1       1           136
        0            80
2       0            97
        1            87
3       0           372
        1           119
Name: count, dtype: int64

In [50]:
groupObjDF=pd.DataFrame(groupObj.value_counts())

In [51]:
groupObjDF

                 count
pclass survived
1      1           136
       0            80
2      0            97
       1            87
3      0           372
       1           119

In [55]:
groupObjDF.index

MultiIndex([(1, 1),
            (1, 0),
            (2, 0),
            (2, 1),
            (3, 0),
            (3, 1)],
           names=['pclass', 'survived'])

In [52]:
groupObjDF.loc[(1, 1)]

count    136
Name: (1, 1), dtype: int64

In [53]:
groupObjDF.loc[(2, 1)]

count    87
Name: (2, 1), dtype: int64

In [54]:
groupObjDF.loc[(3, 1)]

count    119
Name: (3, 1), dtype: int64

In [26]:
# - 그룹별로 집계연산 수행
print(groupObj.count())

        survived
pclass
1            216
2            184
3            491

In [29]:
# 생존인원

titanDF.survived.sum()

342

In [30]:
# 전체인원

titanDF.survived.count()

891

In [37]:
-titanDF.survived.astype('bool')

0      False
1       True
2       True
3       True
4      False
       ...
886    False
887     True
888    False
889     True
890    False
Name: survived, Length: 891, dtype: bool

In [38]:
def myfunc(obj):
    print(type(obj), obj.head(3))
    return obj.mean()

In [39]:
groupObj.agg(['count',myfunc])

<class 'pandas.core.series.Series'> 1    1
3    1
6    0
Name: survived, dtype: int64
<class 'pandas.core.series.Series'> 9     1
15    1
17    1
Name: survived, dtype: int64
<class 'pandas.core.series.Series'> 0    0
2    1
4    0
Name: survived, dtype: int64

       survived
          count    myfunc
pclass
1           216  0.629630
2           184  0.472826
3           491  0.242363

In [ ]:
groupObj.agg(['count',myfunc])